-- 5. Связь факультеты ↔ предметы
DROP TABLE IF EXISTS faculty_subjects;

-- 6. Направления (зависят от faculties)
DROP TABLE IF EXISTS directions;

-- 2. Рейтинг вузов (зависит от universities)
DROP TABLE IF EXISTS university_ratings;

-- 8. Избранное (зависит от users и universities)
DROP TABLE IF EXISTS favorites;

-- 9. История поиска (зависит от users)
DROP TABLE IF EXISTS search_history;

-- 3. Факультеты (зависят от universities)
DROP TABLE IF EXISTS faculties;

-- 4. Предметы ЕГЭ (на них ссылались faculty_subjects)
DROP TABLE IF EXISTS subjects;

-- 7. Пользователи
DROP TABLE IF EXISTS users;

-- 1. Университеты (базовая таблица)
DROP TABLE IF EXISTS universities;





-- 1. Создание таблицы университетов
    CREATE TABLE IF NOT EXISTS universities (
        id SERIAL PRIMARY KEY,
        name TEXT,
        city TEXT,
        type TEXT,
        specialty TEXT,
        tuition_fee INTEGER,
        min_score INTEGER,
        budget_places INTEGER,
        paid_places INTEGER,
        has_dormitory INTEGER,
        has_military INTEGER,
        photo_key TEXT
    );

-- 2. Рейтинг вузов
CREATE TABLE IF NOT EXISTS university_ratings (
    university_id    INTEGER    PRIMARY KEY
        REFERENCES universities(id)
        ON DELETE CASCADE,
    rank_position    INTEGER    NOT NULL
);

-- 3. Факультеты
CREATE TABLE IF NOT EXISTS faculties (
    id               SERIAL PRIMARY KEY,
    university_id    INTEGER    NOT NULL
        REFERENCES universities(id)
        ON DELETE CASCADE,
    name             TEXT       NOT NULL
);

-- 4. Предметы ЕГЭ
CREATE TABLE IF NOT EXISTS subjects (
    id               SERIAL PRIMARY KEY,
    name             TEXT    NOT NULL UNIQUE
);

-- 5. Связь факультеты ↔ предметы
CREATE TABLE IF NOT EXISTS faculty_subjects (
    faculty_id       INTEGER    NOT NULL
        REFERENCES faculties(id)
        ON DELETE CASCADE,
    subject_id       INTEGER    NOT NULL
        REFERENCES subjects(id)
        ON DELETE RESTRICT,
    optional         BOOLEAN    NOT NULL DEFAULT FALSE,
    PRIMARY KEY (faculty_id, subject_id)
);

-- 6. Направления (программы) на факультете
CREATE TABLE IF NOT EXISTS directions (
    id               SERIAL PRIMARY KEY,
    faculty_id       INTEGER    NOT NULL
        REFERENCES faculties(id)
        ON DELETE CASCADE,
    name             TEXT       NOT NULL,
    tuition_fee      INTEGER    NOT NULL,
    min_score_budget INTEGER    NOT NULL,  -- Минимальный балл на бюджет
    min_score_paid   INTEGER    NOT NULL,  -- Минимальный балл на платное
    budget_places    INTEGER    NOT NULL,
    paid_places      INTEGER    NOT NULL
);


-- 7. Пользователи
CREATE TABLE IF NOT EXISTS users (
    id               SERIAL PRIMARY KEY,
    email            TEXT    NOT NULL UNIQUE,
    password_hash    TEXT,
    auth_provider    TEXT,
    provider_id      TEXT
);

-- 8. Избранное
CREATE TABLE IF NOT EXISTS favorites (
    user_id          INTEGER    NOT NULL
        REFERENCES users(id)
        ON DELETE CASCADE,
    university_id    INTEGER    NOT NULL
        REFERENCES universities(id)
        ON DELETE CASCADE,
    added_at         TIMESTAMPTZ NOT NULL DEFAULT NOW(),
    PRIMARY KEY (user_id, university_id)
);

-- 9. История поиска
CREATE TABLE IF NOT EXISTS search_history (
    id               SERIAL PRIMARY KEY,
    user_id          INTEGER       NOT NULL
        REFERENCES users(id)
        ON DELETE CASCADE,
    filters          JSONB         NOT NULL,
    searched_at      TIMESTAMPTZ   NOT NULL DEFAULT NOW()
);

-- Дополнительные индексы для производительности
CREATE INDEX IF NOT EXISTS idx_faculties_univ ON faculties(university_id);
CREATE INDEX IF NOT EXISTS idx_directions_faculty ON directions(faculty_id);
CREATE INDEX IF NOT EXISTS idx_history_user ON search_history(user_id);





-- Заполнение таблицы Subjects данными
INSERT INTO subjects (name)
VALUES 
    ('Русский язык'),
    ('Математика (профильная)'),
    ('Физика'),
    ('Химия'),
    ('История'),
    ('Обществознание'),
    ('Информатика'),
    ('Биология'),
    ('География'),
    ('Английский язык'),
    ('Немецкий язык'),
    ('Французский язык'),
    ('Испанский язык'),
    ('Китайский язык'),
    ('Литература');


-- Заполнение таблицы университетов тестовыми данными
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
    ('МГУ им. М.В. Ломоносова', 'Москва', 'государственный', 'Информатика', 260100, 228, 6656, 4942, 1, 1, ''),
    ('СПбГУ', 'Санкт-Петербург', 'государственный', 'Математика', 180000, 210, 3500, 4000, 1, 1, ''),
    ('НИУ ВШЭ', 'Москва', 'государственный', 'Экономика', 300000, 250, 3000, 2000, 1, 0, ''),
    ('МФТИ', 'Москва', 'государственный', 'Физика', 320000, 270, 500, 1000, 0, 1, ''),
    ('РЭУ им. Г.В. Плеханова', 'Москва', 'государственный', 'Экономика', 210000, 220, 4000, 3000, 1, 0, '');

--50 вузов
-- МГУ им. М.В. Ломоносова
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Московский государственный университет имени М.В. Ломоносова (МГУ)', 'Москва', 'государственный', 'Программист', 350000, 280, 4000, 2000, 1, 1, '');

-- СПбГУ
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Санкт-Петербургский государственный университет (СПбГУ)', 'Санкт-Петербург', 'государственный', 'Экономист', 300000, 270, 3000, 1500, 1, 1, '');

-- МФТИ
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Московский физико-технический институт (МФТИ)', 'Москва', 'государственный', 'Инженер', 320000, 290, 1200, 800, 1, 1, '');

-- МИФИ
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Национальный исследовательский ядерный университет "МИФИ"', 'Москва', 'государственный', 'Физик', 310000, 280, 1000, 500, 1, 1, '');

-- НГУ
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Новосибирский государственный университет (НГУ)', 'Новосибирск', 'государственный', 'Преподаватель', 250000, 270, 2000, 1200, 1, 0, '');
-- Томский государственный университет (ТГУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Томский государственный университет (ТГУ)', 'Томск', 'государственный', 'Философ', 240000, 265, 1500, 1000, 1, 0, '');

-- Казанский (Приволжский) федеральный университет (КФУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Казанский (Приволжский) федеральный университет (КФУ)', 'Казань', 'государственный', 'Дизайнер', 220000, 260, 2500, 1500, 1, 1, '');

-- Уральский федеральный университет имени первого Президента России Б.Н. Ельцина (УрФУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Уральский федеральный университет имени первого Президента России Б.Н. Ельцина (УрФУ)', 'Екатеринбург', 'государственный', 'Инженер', 230000, 270, 2000, 1200, 1, 1, '');

-- Российский университет дружбы народов (РУДН)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Российский университет дружбы народов (РУДН)', 'Москва', 'государственный', 'Маркетолог', 280000, 275, 1500, 2000, 1, 0, '');

-- Санкт-Петербургский политехнический университет Петра Великого (СПбПУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Санкт-Петербургский политехнический университет Петра Великого (СПбПУ)', 'Санкт-Петербург', 'государственный', 'Программист', 250000, 265, 3000, 2000, 1, 1, '');
-- Московский государственный технический университет имени Н.Э. Баумана (МГТУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Московский государственный технический университет имени Н.Э. Баумана (МГТУ)', 'Москва', 'государственный', 'Инженер', 300000, 285, 2500, 1200, 1, 1, '');

-- Национальный исследовательский университет "Высшая школа экономики" (НИУ ВШЭ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Национальный исследовательский университет "Высшая школа экономики" (НИУ ВШЭ)', 'Москва', 'государственный', 'Экономист', 320000, 275, 2000, 3000, 1, 0, '');

-- Московский авиационный институт (МАИ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Московский авиационный институт (МАИ)', 'Москва', 'государственный', 'Инженер', 280000, 270, 2000, 1500, 1, 1, '');

-- Московский государственный институт международных отношений (МГИМО)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Московский государственный институт международных отношений (МГИМО)', 'Москва', 'государственный', 'Журналист', 400000, 290, 800, 1200, 1, 0, '');

-- Санкт-Петербургский государственный электротехнический университет "ЛЭТИ"
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Санкт-Петербургский государственный электротехнический университет "ЛЭТИ"', 'Санкт-Петербург', 'государственный', 'Программист', 250000, 260, 1800, 1200, 1, 1, '');
-- Томский политехнический университет (ТПУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Томский политехнический университет (ТПУ)', 'Томск', 'государственный', 'Инженер', 240000, 265, 1800, 1500, 1, 1, '');

-- Южный федеральный университет (ЮФУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Южный федеральный университет (ЮФУ)', 'Ростов-на-Дону', 'государственный', 'Дизайнер', 220000, 260, 2000, 1800, 1, 1, '');

-- Российский государственный гуманитарный университет (РГГУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Российский государственный гуманитарный университет (РГГУ)', 'Москва', 'государственный', 'Философ', 210000, 255, 1500, 1200, 1, 0, '');

-- Национальный исследовательский технологический университет "МИСиС"
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Национальный исследовательский технологический университет "МИСиС"', 'Москва', 'государственный', 'Инженер', 280000, 270, 1800, 1600, 1, 1, '');

-- Нижегородский государственный университет имени Н.И. Лобачевского (ННГУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Нижегородский государственный университет имени Н.И. Лобачевского (ННГУ)', 'Нижний Новгород', 'государственный', 'Программист', 230000, 260, 2000, 1500, 1, 0, '');
-- Сибирский федеральный университет (СФУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Сибирский федеральный университет (СФУ)', 'Красноярск', 'государственный', 'Преподаватель', 200000, 255, 2000, 1700, 1, 0, '');

-- Дальневосточный федеральный университет (ДВФУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Дальневосточный федеральный университет (ДВФУ)', 'Владивосток', 'государственный', 'Маркетолог', 220000, 260, 1800, 1600, 1, 0, '');

-- Пермский государственный национальный исследовательский университет (ПГНИУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Пермский государственный национальный исследовательский университет (ПГНИУ)', 'Пермь', 'государственный', 'Философ', 190000, 250, 1500, 1200, 1, 0, '');

-- Самарский национальный исследовательский университет имени академика С.П. Королева (Самарский университет)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Самарский национальный исследовательский университет имени академика С.П. Королева (Самарский университет)', 'Самара', 'государственный', 'Инженер', 230000, 260, 1600, 1400, 1, 1, '');

-- Северо-Восточный федеральный университет имени М.К. Аммосова (СВФУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Северо-Восточный федеральный университет имени М.К. Аммосова (СВФУ)', 'Якутск', 'государственный', 'Диктор', 180000, 240, 1200, 1000, 1, 0, '');
-- Тюменский государственный университет (ТюмГУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Тюменский государственный университет (ТюмГУ)', 'Тюмень', 'государственный', 'Юрист', 200000, 250, 1500, 1200, 1, 0, '');

-- Башкирский государственный университет (БашГУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Башкирский государственный университет (БашГУ)', 'Уфа', 'государственный', 'Программист', 180000, 240, 1400, 1000, 1, 0, '');

-- Белгородский государственный университет (БелГУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Белгородский государственный университет (БелГУ)', 'Белгород', 'государственный', 'Журналист', 170000, 235, 1200, 900, 0, 0, '');

-- Воронежский государственный университет (ВГУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Воронежский государственный университет (ВГУ)', 'Воронеж', 'государственный', 'Экономист', 210000, 260, 1800, 1400, 1, 0, '');

-- Иркутский государственный университет (ИГУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Иркутский государственный университет (ИГУ)', 'Иркутск', 'государственный', 'Философ', 190000, 245, 1200, 800, 1, 0, '');
-- Кемеровский государственный университет (КемГУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Кемеровский государственный университет (КемГУ)', 'Кемерово', 'государственный', 'Маркетолог', 180000, 240, 1200, 800, 0, 1, '');

-- Кубанский государственный университет (КубГУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Кубанский государственный университет (КубГУ)', 'Краснодар', 'государственный', 'Программист', 200000, 245, 1400, 1000, 1, 0, '');

-- Марийский государственный университет (МарГУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Марийский государственный университет (МарГУ)', 'Йошкар-Ола', 'государственный', 'Философ', 160000, 230, 1000, 700, 1, 0, '');

-- Мордовский государственный университет имени Н.П. Огарева (МГУ им. Огарева)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Мордовский государственный университет имени Н.П. Огарева (МГУ им. Огарева)', 'Саранск', 'государственный', 'Дизайнер', 170000, 235, 1100, 800, 1, 0, '');

-- Омский государственный университет имени Ф.М. Достоевского (ОмГУ)
INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES 
('Омский государственный университет имени Ф.М. Достоевского (ОмГУ)', 'Омск', 'государственный', 'Юрист', 190000, 245, 1300, 900, 1, 0, '');

INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES
-- 35. Московский государственный юридический университет имени О.Е. Кутафина (МГЮА)
('Московский государственный юридический университет имени О.Е. Кутафина (МГЮА)', 'Москва', 'государственный', 'Юрист', 250000, 270, 2000, 1500, 1, 0, ''),
-- 36. Санкт-Петербургский государственный электротехнический университет "ЛЭТИ"
('Санкт-Петербургский государственный электротехнический университет "ЛЭТИ"', 'Санкт-Петербург', 'государственный', 'Программист', 230000, 260, 1800, 1200, 0, 1, ''),
-- 37. Национальный исследовательский Московский государственный строительный университет
('Национальный исследовательский Московский государственный строительный университет', 'Москва', 'государственный', 'Инженер', 220000, 250, 1500, 1000, 1, 0, ''),
-- 38. Самарский национальный исследовательский университет имени академика С.П. Королева
('Самарский национальный исследовательский университет имени академика С.П. Королева', 'Самара', 'государственный', 'Инженер', 240000, 260, 1800, 1500, 1, 1, ''),
-- 39. Санкт-Петербургский горный университет
('Санкт-Петербургский горный университет', 'Санкт-Петербург', 'государственный', 'Инженер', 250000, 270, 2000, 1400, 1, 1, ''),
-- 40. Сибирский государственный медицинский университет (СибГМУ)
('Сибирский государственный медицинский университет (СибГМУ)', 'Томск', 'государственный', 'Медик', 260000, 280, 800, 1200, 1, 0, ''),
-- 41. Казанский государственный медицинский университет
('Казанский государственный медицинский университет', 'Казань', 'государственный', 'Медик', 240000, 270, 1000, 1300, 1, 0, ''),
-- 42. Воронежский государственный университет
('Воронежский государственный университет', 'Воронеж', 'государственный', 'Экономист', 200000, 250, 1500, 1200, 1, 0, ''),
-- 43. Самарский государственный медицинский университет
('Самарский государственный медицинский университет', 'Самара', 'государственный', 'Медик', 250000, 270, 800, 1000, 1, 0, ''),
-- 44. Казанский национальный исследовательский технический университет им. А.Н. Туполева (КАИ)
('Казанский национальный исследовательский технический университет им. А.Н. Туполева (КАИ)', 'Казань', 'государственный', 'Инженер', 240000, 260, 1800, 1500, 1, 1, '');

INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES
-- 45. Московский педагогический государственный университет (МПГУ)
('Московский педагогический государственный университет (МПГУ)', 'Москва', 'государственный', 'Преподаватель', 200000, 240, 1200, 1000, 1, 0, ''),
-- 46. Российский государственный педагогический университет имени А.И. Герцена (РГПУ)
('Российский государственный педагогический университет имени А.И. Герцена (РГПУ)', 'Санкт-Петербург', 'государственный', 'Преподаватель', 210000, 245, 1300, 1100, 1, 0, ''),
-- 47. Воронежский государственный технический университет
('Воронежский государственный технический университет', 'Воронеж', 'государственный', 'Инженер', 220000, 250, 1500, 1200, 0, 1, ''),
-- 48. Российский государственный гуманитарный университет (РГГУ)
('Российский государственный гуманитарный университет (РГГУ)', 'Москва', 'государственный', 'Философ', 190000, 230, 1000, 800, 1, 0, ''),
-- 49. Томский государственный университет систем управления и радиоэлектроники (ТУСУР)
('Томский государственный университет систем управления и радиоэлектроники (ТУСУР)', 'Томск', 'государственный', 'Программист', 220000, 260, 1800, 1300, 1, 1, ''),
-- 50. Алтайский государственный университет
('Алтайский государственный университет', 'Барнаул', 'государственный', 'Экономист', 190000, 230, 1200, 900, 1, 0, ''),
-- 51. Российский химико-технологический университет имени Д.И. Менделеева
('Российский химико-технологический университет имени Д.И. Менделеева', 'Москва', 'государственный', 'Инженер', 240000, 260, 1500, 1200, 1, 1, ''),
-- 52. Белгородский государственный технологический университет имени В.Г. Шухова
('Белгородский государственный технологический университет имени В.Г. Шухова', 'Белгород', 'государственный', 'Инженер', 200000, 240, 1400, 1000, 1, 0, ''),
-- 53. Санкт-Петербургский государственный архитектурно-строительный университет
('Санкт-Петербургский государственный архитектурно-строительный университет', 'Санкт-Петербург', 'государственный', 'Архитектор', 230000, 250, 1600, 1200, 0, 0, ''),
-- 54. Пермский национальный исследовательский политехнический университет
('Пермский национальный исследовательский политехнический университет', 'Пермь', 'государственный', 'Инженер', 220000, 255, 1500, 1100, 1, 0, '');

INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES
-- 55. Филиал ФГБОУ ВО "Самарский государственный технический университет" в г. Сызрани
('Филиал ФГБОУ ВО "Самарский государственный технический университет" в г. Сызрани', 'Сызрань', 'государственный', 'Инженер', 180000, 230, 800, 600, 1, 0, ''),
-- 56. Московский государственный нефтяной технический университет
('Московский государственный нефтяной технический университет', 'Москва', 'государственный', 'Инженер', 250000, 260, 1200, 1000, 1, 1, ''),
-- 57. Университет "Дубна"
('Университет "Дубна"', 'Дубна', 'государственный', 'Программист', 190000, 240, 1000, 800, 1, 0, ''),
-- 58. Южно-Российский государственный политехнический университет имени М.И. Платова
('Южно-Российский государственный политехнический университет имени М.И. Платова', 'Новочеркасск', 'государственный', 'Инженер', 200000, 250, 1400, 1200, 1, 1, ''),
-- 59. Московский государственный аграрный университет имени К.А. Тимирязева
('Московский государственный аграрный университет имени К.А. Тимирязева', 'Москва', 'государственный', 'Агроном', 180000, 230, 900, 700, 1, 0, ''),
-- 60. Нижегородский государственный технический университет имени Р.Е. Алексеева
('Нижегородский государственный технический университет имени Р.Е. Алексеева', 'Нижний Новгород', 'государственный', 'Инженер', 220000, 250, 1600, 1200, 1, 1, ''),
-- 61. Национальный исследовательский университет "Московский институт электронной техники"
('Национальный исследовательский университет "Московский институт электронной техники"', 'Москва', 'государственный', 'Программист', 240000, 260, 1500, 1300, 1, 1, ''),
-- 62. Московский государственный технологический университет "СТАНКИН"
('Московский государственный технологический университет "СТАНКИН"', 'Москва', 'государственный', 'Инженер', 230000, 250, 1500, 1200, 1, 1, ''),
-- 63. Ставропольский государственный аграрный университет
('Ставропольский государственный аграрный университет', 'Ставрополь', 'государственный', 'Агроном', 170000, 230, 1000, 800, 1, 0, ''),
-- 64. Московский автомобильно-дорожный государственный технический университет (МАДИ)
('Московский автомобильно-дорожный государственный технический университет (МАДИ)', 'Москва', 'государственный', 'Инженер', 240000, 260, 1500, 1200, 1, 1, '');

INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES
-- 65. МИРЭА – Российский технологический университет
('МИРЭА – Российский технологический университет', 'Москва', 'государственный', 'Программист', 240000, 260, 1600, 1300, 1, 1, ''),
-- 66. Башкирский государственный медицинский университет
('Башкирский государственный медицинский университет', 'Уфа', 'государственный', 'Медик', 250000, 270, 1000, 1300, 1, 0, ''),
-- 67. Санкт-Петербургский государственный педиатрический медицинский университет
('Санкт-Петербургский государственный педиатрический медицинский университет', 'Санкт-Петербург', 'государственный', 'Медик', 260000, 275, 800, 1200, 1, 0, ''),
-- 68. Национальный исследовательский Мордовский государственный университет
('Национальный исследовательский Мордовский государственный университет', 'Саранск', 'государственный', 'Философ', 180000, 240, 1100, 800, 1, 0, ''),
-- 69. Волгоградский государственный университет
('Волгоградский государственный университет', 'Волгоград', 'государственный', 'Экономист', 200000, 245, 1200, 1000, 1, 0, ''),
-- 70. Курский государственный медицинский университет
('Курский государственный медицинский университет', 'Курск', 'государственный', 'Медик', 230000, 250, 900, 1200, 1, 0, ''),
-- 71. Южно-Российский государственный политехнический университет имени М.И. Платова
('Южно-Российский государственный политехнический университет имени М.И. Платова', 'Новочеркасск', 'государственный', 'Инженер', 220000, 250, 1400, 1200, 1, 1, ''),
-- 72. Московский государственный аграрный университет имени К.А. Тимирязева
('Московский государственный аграрный университет имени К.А. Тимирязева', 'Москва', 'государственный', 'Агроном', 190000, 230, 1000, 800, 1, 0, ''),
-- 73. Нижегородский государственный технический университет имени Р.Е. Алексеева
('Нижегородский государственный технический университет имени Р.Е. Алексеева', 'Нижний Новгород', 'государственный', 'Инженер', 230000, 250, 1600, 1200, 1, 1, ''),
-- 74. Технологический университет (МГТУ)
('Технологический университет (МГТУ)', 'Москва', 'государственный', 'Программист', 220000, 260, 1400, 1100, 1, 0, '');

INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES
-- 75. Московский государственный областной университет
('Московский государственный областной университет', 'Москва', 'государственный', 'Преподаватель', 200000, 240, 1200, 1000, 1, 0, ''),
-- 76. Государственный университет управления
('Государственный университет управления', 'Москва', 'государственный', 'Маркетолог', 220000, 250, 1400, 1200, 1, 0, ''),
-- 77. Томский государственный архитектурно-строительный университет
('Томский государственный архитектурно-строительный университет', 'Томск', 'государственный', 'Архитектор', 210000, 245, 1200, 900, 1, 0, ''),
-- 78. Тюменский индустриальный университет
('Тюменский индустриальный университет', 'Тюмень', 'государственный', 'Инженер', 220000, 250, 1400, 1100, 0, 1, ''),
-- 79. Томский государственный университет
('Томский государственный университет', 'Томск', 'государственный', 'Философ', 200000, 240, 1100, 900, 1, 0, ''),
-- 80. Петрозаводский государственный университет
('Петрозаводский государственный университет', 'Петрозаводск', 'государственный', 'Экономист', 190000, 230, 1000, 800, 1, 0, ''),
-- 81. Московский городской педагогический университет
('Московский городской педагогический университет', 'Москва', 'государственный', 'Преподаватель', 200000, 240, 1200, 1000, 1, 0, ''),
-- 82. Волгоградский государственный медицинский университет
('Волгоградский государственный медицинский университет', 'Волгоград', 'государственный', 'Медик', 250000, 260, 900, 1200, 1, 0, ''),
-- 83. Санкт-Петербургский государственный морской технический университет
('Санкт-Петербургский государственный морской технический университет', 'Санкт-Петербург', 'государственный', 'Инженер', 240000, 260, 1300, 1100, 1, 1, ''),
-- 84. Донской государственный технический университет
('Донской государственный технический университет', 'Ростов-на-Дону', 'государственный', 'Инженер', 230000, 250, 1400, 1200, 1, 1, '');

INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES
-- 85. Саратовский национальный исследовательский государственный университет имени Н.Г. Чернышевского
('Саратовский национальный исследовательский государственный университет имени Н.Г. Чернышевского', 'Саратов', 'государственный', 'Философ', 190000, 240, 1200, 900, 1, 0, ''),
-- 86. Уральский государственный медицинский университет
('Уральский государственный медицинский университет', 'Екатеринбург', 'государственный', 'Медик', 260000, 270, 1000, 1300, 1, 0, ''),
-- 87. Южно-Западный государственный университет
('Южно-Западный государственный университет', 'Курск', 'государственный', 'Экономист', 200000, 250, 1300, 1000, 1, 0, ''),
-- 88. Саратовский государственный медицинский университет имени В.И. Разумовского
('Саратовский государственный медицинский университет имени В.И. Разумовского', 'Саратов', 'государственный', 'Медик', 240000, 260, 900, 1100, 1, 0, ''),
-- 89. Рязанский государственный медицинский университет имени академика И.П. Павлова
('Рязанский государственный медицинский университет имени академика И.П. Павлова', 'Рязань', 'государственный', 'Медик', 230000, 250, 800, 1000, 1, 0, ''),
-- 90. Казанский национальный исследовательский технологический университет
('Казанский национальный исследовательский технологический университет', 'Казань', 'государственный', 'Инженер', 220000, 250, 1400, 1200, 0, 1, ''),
-- 91. Северный (Арктический) федеральный университет имени М.В. Ломоносова
('Северный (Арктический) федеральный университет имени М.В. Ломоносова', 'Архангельск', 'государственный', 'Архитектор', 200000, 240, 1100, 900, 1, 0, ''),
-- 92. Воронежский государственный технический университет
('Воронежский государственный технический университет', 'Воронеж', 'государственный', 'Инженер', 230000, 250, 1500, 1200, 1, 1, ''),
-- 93. Балтийский федеральный университет имени И. Канта
('Балтийский федеральный университет имени И. Канта', 'Калининград', 'государственный', 'Преподаватель', 200000, 240, 1200, 1000, 1, 0, ''),
-- 94. Северо-Кавказский федеральный университет
('Северо-Кавказский федеральный университет', 'Ставрополь', 'государственный', 'Экономист', 190000, 230, 1200, 800, 1, 0, '');

INSERT INTO universities (name, city, type, specialty, tuition_fee, min_score, budget_places, paid_places, has_dormitory, has_military, photo_key)
VALUES
-- 95. Алтайский государственный технический университет имени И.И. Ползунова
('Алтайский государственный технический университет имени И.И. Ползунова', 'Барнаул', 'государственный', 'Инженер', 200000, 240, 1300, 1000, 0, 0, ''),
-- 96. Российский новый университет
('Российский новый университет', 'Москва', 'государственный', 'Маркетолог', 210000, 245, 1200, 1000, 1, 0, ''),
-- 97. Кабардино-Балкарский государственный университет им. Х.М. Бербекова
('Кабардино-Балкарский государственный университет им. Х.М. Бербекова', 'Нальчик', 'государственный', 'Преподаватель', 180000, 230, 1100, 900, 1, 0, ''),
-- 98. Омский государственный медицинский университет
('Омский государственный медицинский университет', 'Омск', 'государственный', 'Медик', 230000, 250, 800, 1100, 1, 0, ''),
-- 99. ФГБОУ ВО "Тюменский ГМУ Минздрава России"
('ФГБОУ ВО "Тюменский ГМУ Минздрава России"', 'Тюмень', 'государственный', 'Медик', 240000, 260, 900, 1200, 1, 0, ''),
-- 100. Уфимский государственный авиационный технический университет
('Уфимский государственный авиационный технический университет', 'Уфа', 'государственный', 'Инженер', 220000, 250, 1500, 1200, 0, 1, '');

INSERT INTO university_ratings (university_id, rank_position) VALUES
(1, 1),
(2, 3),
(3, 2),
(4, 5),
(5, 4);

INSERT INTO faculties (university_id, name) VALUES
(1, 'Институт информационных технологий'),
(1, 'Инженерно-физический факультет'),
(2, 'Факультет экономики'),
(3, 'Факультет программной инженерии'),
(4, 'Факультет машиностроения');

INSERT INTO faculty_subjects (faculty_id, subject_id, optional) VALUES
(1, 1, FALSE), -- математика
(1, 3, FALSE), -- информатика
(2, 4, FALSE), -- физика
(3, 5, TRUE),  -- обществознание
(4, 1, FALSE); -- математика

INSERT INTO directions (
    faculty_id,
    name,
    tuition_fee,
    min_score_budget,
    min_score_paid,
    budget_places,
    paid_places
) VALUES
(1, 'Программная инженерия', 300000, 260, 230, 60, 40),
(1, 'Прикладная информатика', 290000, 255, 220, 50, 30),
(2, 'Ядерная физика', 320000, 270, 240, 40, 20),
(3, 'Экономика и финансы', 280000, 250, 210, 70, 50),
(4, 'Машиностроение', 260000, 245, 215, 80, 60);



